public class Main {
    public static void main(String[] args) {

        // Задание1
        System.out.println("Задача 1");

        int age = 18;
        if (age >= 18); {
            System.out.println("Можно поздравить с совершеннолетием!");
        }

        int age1 = 17;
        if ( age1 <=18 ); {
            System.out.println("Возраст совершеннолетия еще не наступил, нужно немного подождать!");
        }

        //Задание2
        System.out.println("Задача 2");

        int age2 = 7;
        if  (age2 <=7) {
            System.out.println("Ребенок ходит в школу, если его возраст равен или меньше 7 лет");
        }
        if ( age2 >=18 && age2 <24) {
            System.out.println("Человек уже закончил школу и может отправляться в университет если его возраст 18 и больше лет");
        }
        if (age2 >= 24 ) {
            System.out.println("Человек окончил университет и ему пора искать первую работу, если ему больше 24 лет");
        }











    }
}